# NewInstanceBinding Method (CategorySet)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewInstanceBinding Method (CategorySet)
Application Class See Also
---
Creates a new instance binding object containing the categories passed as a parameter.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public InstanceBinding NewInstanceBinding(
	CategorySet categorySet
)
```

Visual Basic
---
```text
Public Function NewInstanceBinding ( _
	categorySet As CategorySet _
) As InstanceBinding
```

Visual C++
---
```text
public:
InstanceBinding^ NewInstanceBinding(
	CategorySet^ categorySet
)
```

# ### Parameters
categorySet
    Type: Autodesk.Revit.DB..::..CategorySetA set of categories that will be added to the binding.
# ### Return Value
A new instance binding object.
# Remarks
Instance binding objects are used for attaching shared parameter definitions to all instances of an element within a category.
# See Also
Application Class
NewInstanceBinding Overload
Autodesk.Revit.Creation Namespace